In [3]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [71]:
names=['jomana','sahab','role','futoon']
lst=pd.Series(names,index=[1,2,3,4])
lst

1    jomana
2     sahab
3      role
4    futoon
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [72]:
lst.index=[11,12,13,14]
lst

11    jomana
12     sahab
13      role
14    futoon
dtype: object

## Q3: Retrieve First and second elements.

In [73]:
lst[11]

'jomana'

In [74]:
lst[12]

'sahab'

## Q4: Add duplicate elements, then remove the duplication

In [77]:
add_value=pd.Series(('jomana'))
add_value

0    jomana
dtype: object

In [78]:
new_lst=pd.concat([lst,add_value],ignore_index=True )
new_lst

0    jomana
1     sahab
2      role
3    futoon
4    jomana
dtype: object

In [79]:
new_lst.drop_duplicates()

0    jomana
1     sahab
2      role
3    futoon
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [85]:
data = {'ID': [1,2,3],
        'Name': ['Kathey', 'Michael','Kathey'] }

names_id= pd.DataFrame(data, columns=['ID','Name'])
names_id

   ID     Name
0   1   Kathey
1   2  Michael
2   3   Kathey

## Q6: Read educ_figdp_1_Data.csv file

In [103]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [101]:
edu[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [102]:
edu[['GEO','Value']]

                               GEO Value
0    European Union (28 countries)     :
1    European Union (28 countries)     :
2    European Union (28 countries)  5.00
3    European Union (28 countries)  5.03
4    European Union (28 countries)  4.95
..                             ...   ...
379                        Finland  5.90
380                        Finland  6.10
381                        Finland  6.81
382                        Finland  6.85
383                        Finland  6.76

[384 rows x 2 columns]

In [109]:

edu.loc[0:15,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e